In [13]:
import numpy as np
import pandas as pd
import re

In [14]:
def syn_specialization(spec):
    spec = str(spec)
    specs = []
#     specy = re.sub('\)', ']', spec)
    spec = re.sub('\]', '', spec)
#     specs.append(re.sub('\(', '[', specy))
    specs.append(re.sub('\[', '-', spec))
    specs.append(re.sub('\[', ' ', spec))
    return specs
syn_specialization('hel[sll]s')

['hel-slls', 'hel slls']

In [15]:
data = pd.read_csv('all_institution_courses_cleaned.csv')

In [16]:
data.head()

,Unnamed: 0,cid,name,programme,discipline,discipline_group,discipline_group_category,intake,duration_year
0,0,C100,Manish Institute of Computer Studies,Integrated M.C.A.-Integrated Master of Compute...,Computer Science,Computer Application,IT & Computer,60,5
1,1,C100,Manish Institute of Computer Studies,M.C.A. -Master of Computer Applications,Computer Science,Computer Application,IT & Computer,60,3
2,2,C10000,"SIDDARTHA COLLEGE OF EDUCATION, JAMKHANDI",B.Ed.-Bachelor of Education,Education,Education,Education,50,2
3,3,C10002,"VVS'S ARTS/COMM COLLEGE, BIJAPUR",B.C.A.-Bachelor of Computer Applications,COMPUTER,Computer Application,IT & Computer,100,3
4,4,C10002,"VVS'S ARTS/COMM COLLEGE, BIJAPUR",B.A.-Bachelor of Arts,Arts,Arts,Arts,240,3

In [17]:
data = data.drop('Unnamed: 0',axis=1)

In [18]:
data.loc[data.discipline=='N.A.','discipline'] = data.loc[data.discipline=='N.A.','discipline_group']
sum(data.discipline=='N.A.')

0

In [19]:
data['discipline_lower']=data['discipline'].str.lower()

In [22]:
data['discipline_group_lower'] = data['discipline_group'].str.lower()

In [23]:
data.to_csv('all_institution_courses_cleaned_lowered.csv')

In [24]:
combined_spec = pd.DataFrame(list(data.discipline_lower)+list(data.discipline_group_lower))[0].unique()

In [26]:
combined_spec = pd.DataFrame(combined_spec)

In [27]:
combined_spec[1] = combined_spec[0]
combined_spec[2] = combined_spec[1]
combined_spec.head()

                  0                 1                 2
0  computer science  computer science  computer science
1         education         education         education
2          computer          computer          computer
3              arts              arts              arts
4               com               com               com

In [28]:
combined_spec.shape

(26950, 3)

In [29]:
combined_spec[2] = combined_spec[2].apply(syn_specialization)

In [30]:
def ret_0(lst):
    lst = list(lst)
    return lst[0]

In [31]:
def ret_1(lst):
    lst = list(lst)
    return lst[1]

In [32]:
combined_spec[3] = combined_spec[2].apply(ret_0)

In [33]:
combined_spec[2] = combined_spec[2].apply(ret_1)

In [34]:
combined_spec.head()

                  0                 1                 2                 3
0  computer science  computer science  computer science  computer science
1         education         education         education         education
2          computer          computer          computer          computer
3              arts              arts              arts              arts
4               com               com               com               com

In [35]:
def ad_comma(st):
    st = str(st)
    return '"' + st + '"'

In [36]:
for i in range(4):
    combined_spec[i] = combined_spec[i].apply(ad_comma)

In [38]:
combined_spec.head()

,0,1,2,3
0,"""computer science""","""computer science""","""computer science""","""computer science"""
1,"""education""","""education""","""education""","""education"""
2,"""computer""","""computer""","""computer""","""computer"""
3,"""arts""","""arts""","""arts""","""arts"""
4,"""com""","""com""","""com""","""com"""

In [39]:
combined_spec.to_csv('entity_specs.csv',header=None,index=None)